# Напишите программу, которая вводит два целых числа и находит их произведение, не используя операцию умножения.
# Учтите, что числа могут быть отрицательными.
#
# Входные данные:
# Входная строка содержит два целых числа.
# Выходные данные:
# Программа должна вывести произведение введённых чисел.

# Решение:
# a = int(input("Введите число А: "))
# b = int(input("Введите число B: "))
# c = -b
#
# summa = 0
# if b < 0:
#     for i in range(c):
#         summa -= a
# else:
#     for i in range(b):
#         summa += a
#
# print(summa)